[
  [
    {
      "skill": "HTML5",
      "icon": "/logos/html5.svg",
      "info": "The standard markup language every web developer must know to create the base of a webpage."
    },
    {
      "skill": "CSS3",
      "icon": "/logos/css3.svg",
      "info": "I design responsive applications that adapt seamlessly across devices, while following accessibility and usability best practices."
    },
    {
      "skill": "JavaScript",
      "icon": "/logos/javascript.svg",
      "info": "Experienced with ES6+ features. JavaScript is my primary language for developing dynamic and interactive web applications."
    },
    {
      "skill": "TypeScript",
      "icon": "/logos/typescript.svg",
      "info": "I use TypeScript primarily with React to enforce static typing, reduce runtime errors, and improve code maintainability."
    },
    {
      "skill": "React",
      "icon": "/logos/react.svg",
      "info": "A front-end JavaScript library that I use to build modular, reusable components. This website itself was built with React."
    }
  ],
  [
    {
      "skill": "Node.js",
      "icon": "/logos/nodejs.svg",
      "info": "I use Node.js to develop scalable back-end applications, maintaining a unified JavaScript ecosystem across the stack."
    },
    {
      "skill": "Express.js",
      "icon": "/logos/express.svg",
      "info": "A lightweight Node.js framework I use for setting up APIs, handling routes, and managing middleware efficiently."
    },
    {
      "skill": "Python",
      "icon": "/logos/python.svg",
      "info": "I use Python alongside Flask for back-end development, offering an alternative to Node.js."
    },
    {
      "skill": "Flask",
      "icon": "/logos/flask.svg",
      "info": "A lightweight Python web framework I use to build flexible and efficient back-end services with minimal overhead."
    },
    {
      "skill": "Passport",
      "icon": "/logos/passport.svg",
      "info": "Middleware for Node.js that allows me to implement authentication strategies like JWTs with ease."
    },
    {
      "skill": "Postman",
      "icon": "/logos/postman.svg",
      "info": "An API testing tool that allows me to send and debug HTTP requests efficiently during API development."
    }
  ],
  [
    {
      "skill": "PostgreSQL",
      "icon": "/logos/postgresql.svg",
      "info": "A robust, open-source relational database that I use to structure and manage data efficiently."
    },
    {
      "skill": "Prisma ORM",
      "icon": "/logos/prisma.svg",
      "info": "A type-safe ORM that simplifies database interactions with an intuitive query API, working seamlessly with PostgreSQL."
    },
    {
      "skill": "SQL",
      "icon": "/logos/sql.svg",
      "info": "Proficient in writing raw SQL queries for CRUD operations before transitioning to ORMs like Prisma (Node.js) and SQLAlchemy (Python)."
    },
    {
      "skill": "MongoDB",
      "icon": "/logos/mongodb.svg",
      "info": "Explored basics of MongoDB for handling unstructured or flexible-schema data, particularly in experimental or prototype applications."
    }
  ],
  [
    {
      "skill": "Git",
      "icon": "/logos/git.svg",
      "info": "Version control system for tracking changes in my projects, working seamlessly with GitHub."
    },
    {
      "skill": "GitHub",
      "icon": "/logos/github.svg",
      "info": "A platform I use to manage repositories, collaborate with others, and deploy projects."
    },
    {
      "skill": "Linux CLI (Bash)",
      "icon": "/logos/linux.svg",
      "info": "Comfortable with standard Bash commands; I use Ubuntu as my primary development environment."
    },
    {
      "skill": "Vite",
      "icon": "/logos/vite.svg",
      "info": "My go-to build tool for React projects, providing fast development and optimized production builds with minimal setup."
    },
    {
      "skill": "Docker",
      "icon": "/logos/docker.svg",
      "info": "Explored Docker to containerize applications and ensure consistent deployment across development and production environments."
    },
    {
      "skill": "AWS",
      "icon": "/logos/aws.svg",
      "info": "Familiar with some essential AWS services such as VPC, EC2, S3, Route53, SES, and RDS."
    }
  ],
  [
    {
      "skill": "Visual Studio Code",
      "icon": "/logos/vs-code.svg",
      "info": "My preferred IDE for web development, where I maintain a minimal setup for a streamlined workflow."
    },
    {
      "skill": "Jest",
      "icon": "/logos/jest.svg",
      "info": "A JavaScript testing framework I use to write unit and integration tests for React and Node.js applications"
    },
    {
      "skill": "npm",
      "icon": "/logos/npm.svg",
      "info": "I use npm to manage dependencies and automate tasks across my development projects."
    },
    {
      "skill": "Go/Golang",
      "icon": "/logos/go.svg",
      "info": "A statically typed language I've explored for its simplicity and performance in building efficient microservices and DevOps tooling."
    }
  ]
]
