[
  [
    {
      "skill": "HTML5",
      "icon": "/logos/html5.svg",
      "info": "The standard markup language every web developer must know to create the base of a webpage."
    },
    {
      "skill": "CSS3",
      "icon": "/logos/css3.svg",
      "info": "Flex, Grid, margin, padding, and borders — these are some of the properties I frequently use to design, lay out, and present webpages."
    },
    {
      "skill": "JavaScript",
      "icon": "/logos/javascript.svg",
      "info": "Experienced with ES6+ features. I spend most of my coding time developing dynamic web applications using JavaScript."
    },
    {
      "skill": "React",
      "icon": "/logos/react.svg",
      "info": "A front-end JavaScript library that I use to build modular, reusable components. This website itself was built with React."
    },
    {
      "skill": "TypeScript",
      "icon": "/logos/typescript.svg",
      "info": "Used primarily with React, TypeScript helps enforce static typing, reducing runtime errors and improving code maintainability."
    }
  ],
  [
    {
      "skill": "Node.js",
      "icon": "/logos/nodejs.svg",
      "info": "I use Node.js to develop scalable back-end applications, maintaining a unified JavaScript ecosystem across the stack."
    },
    {
      "skill": "Express.js",
      "icon": "/logos/express.svg",
      "info": "A lightweight Node.js framework I use for setting up APIs, handling routes, and managing middleware efficiently."
    },
    {
      "skill": "Passport",
      "icon": "/logos/passport.svg",
      "info": "Middleware for Node.js that allows me to implement authentication strategies like JWTs with ease."
    },
    {
      "skill": "Python",
      "icon": "/logos/python.svg",
      "info": "I use Python alongside Flask for back-end development, offering an alternative to Node.js."
    },
    {
      "skill": "Flask",
      "icon": "/logos/flask.svg",
      "info": "A lightweight and flexible Python framework that allows me to build web applications with minimal overhead."
    },
    {
      "skill": "Postman",
      "icon": "/logos/postman.svg",
      "info": "A powerful API testing tool that allows me to send and debug HTTP requests efficiently."
    }
  ],
  [
    {
      "skill": "PostgreSQL",
      "icon": "/logos/postgresql.svg",
      "info": "A robust, open-source relational database that I use to structure and manage data efficiently."
    },
    {
      "skill": "Prisma ORM",
      "icon": "/logos/prisma.svg",
      "info": "A type-safe ORM that simplifies database interactions with an intuitive query API, working seamlessly with PostgreSQL."
    },
    {
      "skill": "SQL",
      "icon": "/logos/sql.svg",
      "info": "Proficient in writing raw SQL queries for CRUD operations before transitioning to ORMs like Prisma (Node.js) and SQLAlchemy (Python)."
    }
  ],
  [
    {
      "skill": "Git",
      "icon": "/logos/git.svg",
      "info": "Version control system for tracking changes in my projects, working seamlessly with GitHub."
    },
    {
      "skill": "GitHub",
      "icon": "/logos/github.svg",
      "info": "A platform I use to manage repositories, collaborate with others, and deploy projects."
    },
    {
      "skill": "Visual Studio Code",
      "icon": "/logos/vs-code.svg",
      "info": "My preferred IDE for web development, where I maintain a minimal setup for a streamlined workflow."
    },
    {
      "skill": "npm",
      "icon": "/logos/npm.svg",
      "info": "I use npm to manage dependencies and automate tasks across my development projects."
    },
    {
      "skill": "Vite",
      "icon": "/logos/vite.svg",
      "info": "My go-to build tool for React projects, providing fast development and optimized production builds with minimal setup."
    },
    {
      "skill": "EJS (Embedded JavaScript)",
      "icon": "/logos/ejs.svg",
      "info": "A templating engine I use for server-side rendering, dynamically generating HTML in full-stack applications."
    }
  ],
  [
    {
      "skill": "UNIX/Linux CLI (Bash)",
      "icon": "/logos/linux.svg",
      "info": "Comfortable with basic CLI commands and currently use Ubuntu as my main OS for development."
    },
    {
      "skill": "Jest",
      "icon": "/logos/jest.svg",
      "info": "A JavaScript testing framework I use to write unit and integration tests for React and Node.js applications"
    },
    {
      "skill": "Responsive design",
      "icon": "/logos/responsive.svg",
      "info": "I ensure web applications adapt seamlessly to different screen sizes while maintaining accessibility standards."
    },
    {
      "skill": "Go/Golang",
      "icon": "/logos/go.svg",
      "info": "A statically typed language I’ve explored for DevOps and microservices, known for its simplicity and performance."
    },
    {
      "skill": "Microsoft Office Suite",
      "icon": "/logos/microsoft-office.svg",
      "info": "Proficient with typical Microsoft Office software applications (i.e., Word, Excel, Powerpoint, Teams, SharePoint, Access, etc.)."
    }
  ]
]
