[
  [
    {
      "skill": "HTML5",
      "icon": "/logos/html5.svg",
      "info": "The standard markup language every web developer must know to create the base of a webpage."
    },
    {
      "skill": "CSS3",
      "icon": "/logos/css3.svg",
      "info": "Flex, grid, margin, padding, borders; These are some properties that I always use to design, layout, and present webpages."
    },
    {
      "skill": "JavaScript",
      "icon": "/logos/javascript.svg",
      "info": "Experienced with ES6+ features. I spend most of my coding time developing dynamic web applications using JavaScript."
    },
    {
      "skill": "React",
      "icon": "/logos/react.svg",
      "info": "A powerful front-end JavaScript library that I use to build modular, reusable components. This website itself was built with React."
    },
    {
      "skill": "TypeScript",
      "icon": "/logos/typescript.svg",
      "info": "Used primarily with React, TypeScript helps enforce static typing, reducing runtime errors and improving code maintainability."
    },
    {
      "skill": "Tailwind CSS",
      "icon": "/logos/tailwind.svg",
      "info": "A utility-first framework that speeds up styling. While I often prefer vanilla CSS, I recognize Tailwind's advantages for large-scale projects."
    }
  ],
  [
    {
      "skill": "Node.js",
      "icon": "/logos/nodejs.svg",
      "info": "As JavaScript is my programming language of choice, I use Node.js for building back-end applications with JavaScript outside the browser."
    },
    {
      "skill": "Express.js",
      "icon": "/logos/express.svg",
      "info": "A minimalist Node.js framework I use to handle routing, middleware, and API endpoints in web applications."
    },
    {
      "skill": "Passport",
      "icon": "/logos/passport.svg",
      "info": "A useful middleware for Node.js which allows me to easily implement user authentication strategies such as JWTs."
    },
    {
      "skill": "Postman",
      "icon": "/logos/postman.svg",
      "info": "A powerful API testing tool that allows me to send and debug HTTP requests efficiently."
    },
    {
      "skill": "EJS",
      "icon": "/logos/ejs.svg",
      "info": "A templating engine for dynamically generating HTML on the server-side, often used in full-stack applications."
    }
  ],
  [
    {
      "skill": "PostgreSQL",
      "icon": "/logos/postgresql.svg",
      "info": "A robust, open-source relational database that I use to structure and manage data efficiently."
    },
    {
      "skill": "Prisma ORM",
      "icon": "/logos/prisma.svg",
      "info": "A type-safe ORM that integrates well with PostgreSQL, allowing me to manage databases using an OOP approach."
    },
    {
      "skill": "SQL",
      "icon": "/logos/sql.svg",
      "info": "Proficient in writing SQL queries for CRUD operations before transitioning to using ORMs like Prisma."
    }
  ],
  [
    {
      "skill": "Git",
      "icon": "/logos/git.svg",
      "info": "Version control system for tracking changes in my projects, working seamlessly with GitHub."
    },
    {
      "skill": "GitHub",
      "icon": "/logos/github.svg",
      "info": "A platform I use to manage repositories, collaborate with others, and deploy projects."
    },
    {
      "skill": "Visual Studio Code",
      "icon": "/logos/vs-code.svg",
      "info": "My go-to IDE for all web-development programming. I try to keep extensions to a minimal for a lightweight, clean experience."
    },
    {
      "skill": "npm",
      "icon": "/logos/npm.svg",
      "info": "Used to install packages in virtually all my projects including some tools you see here."
    },
    {
      "skill": "Vite",
      "icon": "/logos/vite.svg",
      "info": "My go-to build tool for React projects, offering fast local development and optimized production builds."
    },
    {
      "skill": "Webpack",
      "icon": "/logos/webpack.svg",
      "info": "Primarily used for bundling JavaScript modules and setting up efficient development workflows."
    }
  ],
  [
    {
      "skill": "UNIX/Linux CLI (Bash)",
      "icon": "/logos/linux.svg",
      "info": "Comfortable with basic CLI commands and currently use Ubuntu as my main OS for development."
    },
    {
      "skill": "Jest",
      "icon": "/logos/jest.svg",
      "info": "Implemented test-driven development in some projects by writing unit tests before writing production code."
    },
    {
      "skill": "Responsive design",
      "icon": "/logos/responsive.svg",
      "info": "Ensuring web applications work seamlessly across various screen sizes while considering web accessibility."
    },
    {
      "skill": "Microsoft Office Suite",
      "icon": "/logos/microsoft-office.svg",
      "info": "Proficient with typical Microsoft Office software applications (i.e., Word, Excel, Powerpoint, Teams, Sharepoint, Access, etc.)."
    }
  ]
]
