[
  [
    {
      "skill": "HTML5",
      "icon": "/logos/html5.svg",
      "info": "The standard markup language every web developer must know to create the base of a webpage."
    },
    {
      "skill": "CSS3",
      "icon": "/logos/css3.svg",
      "info": "Flex, grid, margin, padding, and borders; These are properties that I always use to design, layout, and present webpages."
    },
    {
      "skill": "JavaScript",
      "icon": "/logos/javascript.svg",
<<<<<<< HEAD
      "info": "Learned almost entirely ES6. About 90% of my coding time is spent on developing JS and it's derivatives."
=======
      "info": "[Description goes here]."
>>>>>>> eea2c4117dc2704b2ae39b8a6ec2f02a91d01b99
    },
    {
      "skill": "React",
      "icon": "/logos/react.svg",
      "info": "Front-end JavaScript library that I use to create functional, reusable components. This website itself was created with React."
    },
    {
      "skill": "Tailwind CSS",
      "icon": "/logos/tailwind.svg",
      "info": " I've tried Tailwind before and typically choose to stylize without it. However, I can see it being more useful on larger-scale projects."
    }
  ],
  [
    {
      "skill": "Git",
      "icon": "/logos/git.svg",
      "info": "Typical project control manager that works in tandem with GitHub."
    },
    {
      "skill": "GitHub",
      "icon": "/logos/github.svg",
      "info": "Developer platform I use to manage, host, and share all my projects."
    },
    {
      "skill": "Visual Studio Code",
      "icon": "/logos/vs-code.svg",
      "info": "My go-to IDE for all web-dev coding. I try to keep extensions to a minimal for a lightweight, clean experience."
    },
    {
      "skill": "npm",
      "icon": "/logos/npm.svg",
      "info": "Used to install packages in virtually all my projects including some tools you see here."
    },
    {
      "skill": "Webpack",
      "icon": "/logos/webpack.svg",
<<<<<<< HEAD
      "info": "Used Webpack for bundling vanilla JavaScript modules and webpack-dev-server for live-previewing during production."
=======
      "info": "[Description goes here]"
>>>>>>> eea2c4117dc2704b2ae39b8a6ec2f02a91d01b99
    },
    {
      "skill": "Vite",
      "icon": "/logos/vite.svg",
<<<<<<< HEAD
      "info": "All my React projects have started out from a template using Vite. Great as a local development server for local rendering."
=======
      "info": "All my React projects have started out from a template using Vite. Great as a local development server for local rendering"
>>>>>>> eea2c4117dc2704b2ae39b8a6ec2f02a91d01b99
    }
  ],
  [
    {
      "skill": "Jest",
      "icon": "/logos/jest.svg",
      "info": "Implemented test-driven development for some web-applications by setting up unit tests with Jest before producing code."
    },
    {
      "skill": "SQL",
      "icon": "/logos/sql.svg",
<<<<<<< HEAD
      "info": "Used SQL to pull structured data from power system analysis modelling tool (ETAP) to generate PDF reports."
=======
      "info": "[Description goes here]"
>>>>>>> eea2c4117dc2704b2ae39b8a6ec2f02a91d01b99
    },
    {
      "skill": "UNIX/Linux",
      "icon": "/logos/linux.svg",
      "info": "I know the basics of UNIX/Linux OS commands. My current setup is a dual-boot of Windows OS (Personal) and Ubuntu (Work)."
    },
    {
      "skill": "Responsive design",
      "icon": "/logos/responsive.svg",
      "info": "I typically use CSS media queries to accommodate webpages for different screen sizes and also try to be mindful of web accessibility."
    }
  ]
]
